article/C10K.org
#+OPTIONS: ^:nil
#+OPTIONS: \n:t
#+OPTIONS: f:nil
#+OPTIONS: -:nil
#+OPTIONS: author:nil
#+OPTIONS: email:nil
#+OPTIONS: timestamp:nil

C10K问题

是时候让web服务器同时处理1w个客户端了，难道不是吗？毕竟，现在web是一个很大的地方。

现在计算机也很强大。你可以花$1200购买一个1000MHz、2G的RAM、1000Mbit/sec网卡的机器。让我们看看--20000客户端，每个客户端是50KHz,100Kbytes,50Kbits/sec。没有什么比每秒向2w客户端中每1个客户端发送磁盘上的4K字节到网络中更消耗资源的了。所以硬件不再是瓶颈。

1999年一个最繁忙的ftp网站，cdrom.com，竟然通过1G网络宽带能够同时处理1w个客户端。2001年，同样的速度被几家ISP提供。

瘦客户端模型似乎又回来了--这时在互联上的服务器为数千个客户端服务。

考虑到这些，这里有一些关于如何配置操作系统和编写代码支持数千客户端的笔记。我们的讨论是围绕Unix-like操作系统。

* 相关网站

大概看一下Nick Black的优秀论文[[http://dank.qemfd.net/dankwiki/index.php/Network_servers][Fast UNIX Server]]。

2003年十月，Felix von Leitner构建了一个优秀的网页，描述了关于网络伸缩性，包括网络系统调用和操作系统之间的性能对比。他其中一个结论是Linux2.6内核已经打败了2.4内核。

* 首先阅读的书籍

如果你还未阅读过W. Richard Stevens编写的[[http://www.amazon.com/exec/obidos/ASIN/013490012X/][Unix Network Programming]]，赶紧去获取这本书。它描述了许多I/O策略和有关编写高性能服务器的陷阱。它甚至讨论了“惊群”问题。同时你也可以阅读[[http://pl.atyp.us/content/tech/servers.html][Jeff Darcy关于高性能服务器设计的笔记]]。

（其它书籍可能对那些*使用*而不是*编写*web服务器的人更有帮助，Cal Henderson编写的Building Scalable Web Sites)

* I/O框架

下面封装好的库，提出一些技术的抽象概念，使你的代码与操作系统隔离，具有更好的移植性。

+ [[http://www.cs.wustl.edu/~schmidt/ACE.html][ACE]]， 一个重量级C++ I/O框架，包含了一些I/O策略和其它有用东西的面向对象的实现。特别是，它的Reactor是一种处理非阻塞I/O的OO方式，Proactor是一种处理异步I/O的OO方式。
+ [[http://asio.sf.net/][ASIO]]， 一个C++ I/O框架，它是Boost库的一部分。
+ [[http://monkey.org/~provos/libevent][libevent]]， 是一个由Niels Provos编写的轻量级C I/O框架，它支持kqueue，select，很快将支持poll和epoll。我想它只能水平触发，这既有好的一面也有坏的一面。Niels画了一张处理每个事件时间和连接的关系图。它显示了kqueue和epoll是明显的赢家。
+ 我自己尝试编写的轻量级框架（可惜它们没有保持更新）：
  - Poller是一个轻量级的C++ I/O框架，使用底层API（poll,select,/dev/poll,kqueue,sigio)实现了一个水平触发API。
  - rn是一个轻量级C I/O框架。
+ Matt Welsh在2000年4月编写了关于构建可伸缩服务器时如何平衡工作线程与事件驱动技术的使用的论文。论文描述了他的Sandstorm I/O框架一部分。
+ Cory Nelson的Scale!库，一个windows的异步socket,file,和pipe的I/O库。

* I/O策略

网络软件设计者有很多选择，这里有一些：
+ 在一个单线程中是否以及如何执行多个I/O调用
  - 始终不要使用阻塞/同步调用，可以使用多线程或进程实现并发
  - 使用非阻塞调用(如将write()的socket设置O_NONBLOCK)来启动I/O，当它完成后发出就绪通知（如poll()或/dev/poll)，启动下一次的I/O。通常只在网络I/O有用，而在磁盘I/O没用。
  - 使用异步调用(如aio_write())来启动I/O，当I/O结束后发出完成通知（如信号或completion ports），适用于网络和磁盘I/O。
+ 如何控制代码为每个客户端服务
  - 一个客户端对应一个进程
  - 一个OS级别的线程处理多个客户端，每个客户端由如下控制：
    - 一个用户级别线程(如GNU状态线程）
    - 一个状态机
    - 一个continuation
  - 一个OS级别线程对应一个客户端
  - 一个OS级别线程对应一个活跃的客户端
+ 是否使用标准OS服务，或把一些代码放到内核中（如自定义驱动，内核模块，VxD)
以下5个组合看上去比较流行：
1. 一个线程服务多个客户端，使用非阻塞I/O和水平触发就绪通知
2. 一个线程服务多个客户端，使用非阻塞I/O和就绪变化通知
3. 一个服务器线程服务多个客户端，使用异步I/O
4. 一个服务器线程服务一个客户端，使用阻塞I/O
5. 在内核中构建服务器代码

** 一个线程服务多个客户端，使用非阻塞I/O和水平触发就绪通知

...将所有的网络句柄设置为非阻塞模型，使用select()和poll()告之哪个网络句柄已经有数据在等待被处理。使用这个方案，内核告诉你一个文件描述符是否准备好，文件描述符是否有被处理过。（'水平触发'的名称来自于计算机硬件设计；是'边沿触发'的反义词）。

注意：特别地要记住来自内核的就绪通知仅仅只是一个提示；当你试图读取文件描述符时，它可能没有准备好。这就是为什么当使用就绪通知时而使用非阻塞模型是非常重要的。

在这个方法中一个重要的瓶颈是从磁盘read()或sendfile()会被阻塞，如果页面当时没有在内核中；基于一个磁盘文件句柄的非阻塞模型没有作用。同样的事件也会发生在memory-mapped磁盘文件上。第一次服务器需要磁盘I/O，它的处理过程阻塞，所有客户端必须等待，原生非线程性能会被浪费。这就是异步I/O所做的工作。但在如果系统上缺乏AIO，工作线程或进程也可以在处理磁盘I/O时避免这个瓶颈。一种方法是使用memory-mapped文件，如果mincore()指示需要I/O，请求一个工作者来处理I/O，继承处理网络通信。似乎mincore()在基于BSD Unixes像FreeBSD和Solaris上有效，而不是Single Unix Specification的一部分。它在Linux2.3.51内核上有效。

但是在2003年11月Vivek Pei等人报道了两个瓶颈，第一个瓶颈是mincore，另一个是sendfile在访问磁盘时会阻塞。他们修改sendfile()提升性能，使sendfile()在当磁盘页面不在内核时返回像EWOULDBLOCK的结果。

有几种方法用来单线程中告诉哪些非阻塞sockets的I/O已经准备好：
+ 传统的select()
  遗憾的是，select()受限于FD_SETSIZE。这个限制已经编译进了标准库和用户的程序。
+ 传统的poll()
  没有硬性限制poll()能够处理文件描述符的个数，但文件描述符有几千个时，poll()会变慢。因为在任何时间大多数文件描述符是空闲的，扫描成千个文件描述符浪费时间。
+ /dev/poll
  在Solaris上被推荐代替poll()。
  /dev/poll背后的思想是利用经常使用相同的参数多次调用poll()的事实。使用/dev/poll ，你得到一个与/dev/poll相关的开放句柄，只要一次通过写入句柄告诉OS你感兴趣的文件。之后，你仅仅从句柄中读取当前已经准备好的一组文件描述符。
  它悄悄地出现在Solaris 7中，但首次公布是在Solaris8；根据Sun在750个客户端的测试结果，它消耗的资源只有poll()的10%。
  /dev/poll的各种实现都在Linux在都尝试过，但它们没有一个比epoll表现的好。/dev/poll在Linux上不推荐使用。
+ kqueue()
  在FreeBSD上推荐代替poll()。
  见下面，kqueue()可以指定是水平触发还是边沿触发。

