article/C10K.org
** 一个线程服务多个客户端，使用非阻塞I/O和就绪变化通知（边沿触发）

就绪变化通知（或者边沿触发就绪通知）意味着你给予内核一个文件描述符，之后，当文件描述符从未准备好到准备好时，内核会通知你。然后内核假设你知道文件描述已经准备好，不会为这个文件描述符发送任何就绪通知直到你做了一些事件引起文件描述符不再是准备好的(直到你在一个send,recv或accept调用，或一次send或recv传输比请求字节数少上收到EWOULDBLOCK错误)。

当你使用就绪变化通知，你必须准备好处理虚假事件，因为一个常见的实现是当接收任何数据包时就发送通知，不管这个文件描述符是否已经准备好。

与之相反的是"水平触发"就绪通知。边沿触发对编程错误更严格。因为如果你仅仅错过一个事件，这个事件的连接可能被永远卡住。

有几个APIs让应用程序获取文件描述符变成就绪的通知：
+ kqueue()
  在FreeBSD上被推荐代替边沿触发poll。
  FreeBSD4.3之后，支持使用kqueue()/kevent()替换poll()。kqueue()同时支持边沿触发和水平触发。
  像/dev/poll，你分配一个监听对象。与打开文件/dev/poll不同，你调用kqueue()分配一个。为了改变你正在监听的事件或获取当前事件列表，你在kqueue()返回的描述符上调用kevent()。它不仅能够监听socket就绪状态，还能监听普通文件就绪状态，信号，甚至I/O完成事件。
  注意：2000年十月，在FreeBSD上的线程库不能与kqueue()很好的相互作用；明显地，当kqueue()阻塞时，不仅仅是线程会阻塞，而整个进程都会阻塞。
  使用kqueue()的实例和库：
  - [[http://people.freebsd.org/~dwhite/PyKQueue/][PyKQueue]] -- 将Python绑定到kqueue()
  - Ronald F. Guilmette的[[http://www.monkeys.com/kqueue/echo.c][echo服务器示例]]
+ epoll
  在Linux2.6内核被推荐代替边沿触发poll。
  2001年7月11日，Davide Libenzi提出了另一种实时信号；他的补丁就是现在所说的/dev/epoll。它仅仅只看起来像实时信号就绪通知，但它合并了冗余事件，拥有一个更高效的事件检索方法。
  Epoll合并进2.5内核树中，2.5.46后它的接口从一个/dev下特殊文件改变成一个系统调用，sys_epoll。2.4内核中epoll也是有效的。
  在2002万圣节前后，在linux-kernel邮件列表上有一个关于统一epoll,aio,和其它事件源的持久讨论。它可能会发生，但首要的事件是Davide专注于让epoll更稳定。
+ Polyakov的kevent（Linux2.6+）
  2006年2月9日，Evgeniy Polyakov发布了似乎统一epoll和aio的补丁，他的目标是支持网络AIO。参考：
  - [[http://lwn.net/Articles/172844/][LWN关于kevent的文章]]
  - [[http://lkml.org/lkml/2006/7/9/82][他的7月公告]]
  - [[http://tservice.net.ru/~s0mbre/old/?section=projects&item=kevent][他的kevent页面]]
  - [[http://tservice.net.ru/~s0mbre/old/?section=projects&item=kevent][他的naio页面]]
  - [[http://thread.gmane.org/gmane.linux.network/37595/focus=37673][最近的一些讨论]]
+ Drepper的New Network Interface(Linux2.6+的提案)
  2006年，Ulrich Drepper提出一个新的高速异步网络API，参考
  - 他的论文，"The Need for Asynchronous, Zero-Copy Network I/O"
  - 他的幻灯片
  - LWN文章
+ 实时信号
  Linux内核2.4推荐代替边沿触发poll。
  Linux2.4内核通过一个特殊的实时信号发出socket就绪事件。这里是如何开启这个行为：
#+BEGIN_SRC C
/* Mask off SIGIO and the signal you want to use. */
sigemptyset(&sigset);
sigaddset(&sigset, signum);
sigaddset(&sigset, SIGIO);
sigprocmask(SIG_BLOCK, &m_sigset, NULL);
/* For each file descriptor, invoke F_SETOWN, F_SETSIG, and set O_ASYNC. */
fcntl(fd, F_SETOWN, (int) getpid());
fcntl(fd, F_SETSIG, signum);
flags = fcntl(fd, F_GETFL);
flags |= O_NONBLOCK|O_ASYNC;
fcntl(fd, F_SETFL, flags);
#+END_SRC
  当标准I/O函数像read()或write()完成时，发送那样的信号。为了使用它，在外层循环编写一个标准poll()，在循环里面，当你处理所有poll()关注的fd后，你循环调用sigwaitinfo()。
  如果sigwaitinfo或sigtimedwait返回你的实时信号，siginfo.si_fd和siginfo.si_band与pollfd.fd和pollfd.revents所给的信息差不多一样。所以你处理I/O，并且继续调用sigwaitinfo()。
  如果sigwaitinfo返回一个传统的SIGIO信号，信号队列溢出，所以你通过暂时修改信号句柄为SIG_DFL来刷新信号队列，跳出回到外层poll()循环。
+ Signal-per-fd
  Chandra和Mosberger提出了一个修改实时信号的方法，称为"signal-per-fd"，它通过合并冗余事件来减少或消除实时信号的溢出。但是，它并没有epoll性能好。
** 一个服务器线程服务多个客户端，使用异步I/O
这个方式在Unix上还不流行，可能是因很少的操作系统支持异步I/O，或者可能是因为它（像非阻塞I/O）需要重新去思考你的应用。在标准的Unix下，异步I/O通过aio接口提供，将每个I/O操作关联一个信号和值。每个信号和它们的值被高效地排队和分发给用户进程。异步I/O来自POSIX 1003.1b实时扩展，同时也在Single Unix Specification，version 2中。

AIO是通常使用边沿触发完成通知。也就是当操作完成时一个信号被排入队列。（也可以通过调用aio_suspend()使用水平触发完成通知，虽然我怀疑很少人这么做）。

glibc 2.1版本之后提供符合标准的一个通用实现，但性能不好。

Ben LaHaise的Linux AIO实现被合并到了Linux内核2.5.32中。它没有使用内核线程，拥有一个非常高效底层的API，但是暂不支持sockets。更多信息：
- "[[http://lse.sourceforge.net/io/aio.html][Kernel Asynchronous I/O (AIO) Support for Linux]]"论文试图展示2.6内核中AIO的实现全部信息
- Benjamin C.R. LaHaise编写的"[[http://www.linuxsymposium.org/2002/view_txt.php?text=abstract&talk=11][Round3:aio vs /dev/epoll]]"
- Bhattacharya, Pratt, Phattacharya编写的"[[http://archive.linuxsymposium.org/ols2003/Proceedings/All-Reprints/Reprint-Pulavarty-OLS2003.pdf][Design Notes on Asynchronous I/O(aio) for Linux]]"
- Linux AIO的[[http://www.kvack.org/~blah/aio/][主页]]
- linux-aio[[http://marc.theaimsgroup.com/?l=linux-aio][邮件列表]]
- [[http://www.ocfs.org/aio/][libaio-oracle]] - 在libaio之上实现的标准Posix AIO的库。
Suparna还建议看一下接近AIO的DAFS的[[http://www.dafscollaborative.org/tools/dafs_api.pdf][API]]

Red Hat AS和Suse SLES都提供了一个基于2.4内核的高性能实现；它与2.6内核实现相关，但不完全相同。

2006年2月，正在为提供网络AIO进行一次新尝试；参考[[http://www.kegel.com/c10k.html#kevent][关于Evgeniy Polyakov的基于事件的AIO的笔记]]。

1999年，SGI为Linux实现高速AIO。1.1版本说是能够在磁盘I/O和sockets上很好的工作。它似乎使用了内核线程。

O'Redilly书POSIX4:Programming for the Real World包含了关于aio的很好介绍。

注意AIO没有提供了以非阻塞的磁盘I/O方式打开文件；如果你在意因打开磁盘文件而引起睡眠，Linus建议你在一个不同的线程中做open()操作，而不是盼望一个aio_open()系统调用。

在Windows下,异步I/O与术语"重叠I/O"和IOCP或"I/Ocompletion ports"密切相关。Microsoft的IOCP组合了异步I/O（像aio_write)和排列完成通知(像当与aio_write一起使用aio_sigevent字段时)的技术。

** 一个服务器线程服务一个客户端

...让read()和write()阻塞，它的缺点是为每个客户端保持一个完整堆栈，非常浪费内存。许多操作系统可能都无法操作上百个线程。如果每个线程拥有2MB栈，在一个拥有1GB用户可访问的虚拟内存的32位机器上运行512个线程，你将耗尽所有虚拟内存。你可以通过给每个线程分配小一点的堆栈来解决这个问题，但大部分线程一旦创建线程后不允许增长线程堆栈，这意味着在设计你的程序时最小化堆栈的使用。你也可以将程序移至到64位处理器来解决这个问题。

Linux,FreeBSD,Solais上的线程支持不断在改善，甚至于主流用户64位的处理器还在后头。或许不远将来，那些更喜欢使用一个线程服务一个客户端的人能够为10000客户端使用这个范式。但是在目前，如果你确实想支持许多客户端，可能使用其它范式更好。

一个毫不掩饰赞成线程的观点，请看由von Behren, Condit, Brewer, UCB编写的[[http://www.usenix.org/events/hotos03/tech/vonbehren.html][Why Events Are A Bad Idea (for High-concurrency Servers)]]，有没有反对线程阵营的人来反驳这个文章呢？

*** LinuxThreads

[[http://pauillac.inria.fr/~xleroy/linuxthreads/][LinuxThreads]] 是标准Linux线程库的名称。从glibc2.0开始被集成到glibc中，几乎与Posix兼容，但达不到主流的性能和信号支持。

*** NGPT：Next Generation Posix Threads for Linux

[[http://www-124.ibm.com/pthreads/][NGPT]] 是一个由IBM启动的一个项目，用于带来对Linux好的Posix兼容线程支持。现在已到2.2稳定版本，并且运行很好...但是NGPT团队已经宣布
把NGPT基础代理改为support-only模式，因为他们觉得这是支持社区长期发展的最好方式。NGPT团队将继续努力改善Linux线程支持，但现在专注于改进NPTL。

