article/C10K.org
*** NPTL：Native Posix Thread Library for Linux

[[http://people.redhat.com/drepper/nptl/][NPTL]] 是由[[http://people.redhat.com/drepper/][Ulrich Drepper]]和[[http://people.redhat.com/mingo/][Ingo Molnar]]发起的项目，带来世界级的Posix Linux线程支持。

2003年十月5日，NPTL作为一个附加目录合并进glibc cvs树中，所以几乎肯定它将会随着glibc下一版本一起发布。

NPTL链接：
- [[http://https//listman.redhat.com/mailman/listinfo/phil-list][讨论NPTL的邮件列表]]
- [[http://people.redhat.com/drepper/nptl/][NPTL源代码]]
- [[http://lwn.net/Articles/10465/][NPTL初始声明]]
- [[http://people.redhat.com/drepper/glibcthreads.html][描述NPTL目标的原始白皮书]]
- [[http://people.redhat.com/drepper/nptl-design.pdf][描述NPTL最终设计的修订白皮书]]
- [[http://marc.theaimsgroup.com/?l=linux-kernel&m=103230439008204&w=2][Ingo Molnar]]的第一个性能测试显示它能够处理10^6个线程
- [[http://marc.theaimsgroup.com/?l=linux-kernel&m=103269598000900&w=2][Ulrich的性能测试]] 比较Linux线程,NPTL,IBM的NGPT的性能。它似乎显示了NPTL比NGPT快的多。
这是我尝试描述NPTL的历史（参考[[http://www.onlamp.com/pub/a/onlamp/2002/11/07/linux_threads.html][Jerry Cooperstein的文章]]）：

2002年3月，NGPT团队的Bill Abt，glibc维护人Ulrich Drepper，和其它人开会找出如何处理Linux线程。其中从会议提出的一个想法是改进互斥性能；Rusty Russell等人随后实现了[[http://marc.theaimsgroup.com/?l=linux-kernel&m=102196625921110&w=2][快速用户空间互斥]](futexes)，它现在被NGPT和NPTL使用。大部分与会员指出NGPT应该合并到glibc中。

Ulrich Drepper虽然不喜欢NGPT，并且指出他可以做的更好。几个月之后，Ulrich Drepper，Ingo Molnar，和其他贡献glibc和内核的人一起编写名为Native Posix Threads Library(NPTL)的线程库。NPTL使用所有为NGPT内核增强设计，使用了少部分新设计。Ingo Molnar描述内核增强如下：
当NPTL使用三个由NGPT引进的内核功能：getpid()返回PID，CLONE_THREAD和futexes；NPTL也使用了（依赖）许多新内核功能。

NGPT一部功能引入内核2.5.8左右时被修改，清理和扩展，例如线程组处理(CLONE_THREAD)。

NPTL开发和使用的内核功能在[[http://%20http//people.redhat.com/drepper/nptl-design.pdf][设计白皮书]] 被描述。

/简短列表：TLS支持，各种clone扩展(CLONE_SETTLS,CLONE_SETTID,CLONE_CLEARTID)，POSIX线程信号处理，sys_exit()扩展，sys_exit_group()系统调用，sys_execve()增强，支持独立线程/

/在扩展PID空间也做了很多工作--例如，procfs因为假设64K PID而崩溃，max_pid和pid分配可伸缩性工作。同时一些性能优化也做得很好/

/本质上新功能并非是为了1:1线程的妥协议方法--内核现在尽可能改善线程，同进我们精确地最小层度上为每个基本线程原语做一些上下文切换和系统调用。/

/两者最大的一个不同点是NPTL是一个1:1线程模型，而NGPT是一个M:N线程模型。尽管如此，Ulrich的初始性能测试几乎显示出NPTL确实与NGPT快得多。/

*** FreeBSD线程支持

FreeBSD同时支持Linux线程和一个用户空间线程库。并且，一个称为KSE的M:N实现在FreeBSD5.0中被引入。参考www.unobvious.com/bsd/freebsd-threads.html.
 
2003年3月25日,Jeff Roberson在freebsd-arch发布:
...感谢由Julian, David Xu, Mini, Da Eischen,提供的基金会和每一位曾经参考KSE和libpthread开发的人。Mini和我已经开发了一个1:1线程实现。这个代码能够和KSE并行，而且不会以任何方式破坏它。

2006年7月，Robert Watson提议1:1线程实现成为FreeBSD7.x的默认形式：
...
*** NetBSD线程支持

根据从自Noriyuki Soda的一篇日志：
/内核支持基于Scheduler Activations模型的M:N线程库在2003-1-18合并到NetBSD-current中。/

更多详情，参考由Nathan J. Williams,Wasabi System编写的[[http://web.mit.edu/nathanw/www/usenix/freenix-sa/][An Implementation of Scheduler Activations on the NetBSD Operating System]]。
*** Solaris线程支持

Solaris对线程的支持从Solaris2到Solaris8在不断地发展，默认线程库使用了一个M:N模型，但是Solaris9默认是1:1模型线程支持。查看[[http://docs.sun.com/db/doc/805-5080][Sun's multithreaded programming guide]] 和[[http://java.sun.com/docs/hotspot/threads/threads.html][Sun's note about Java and Solaris threading]].
*** JDK1.3.x和更早Java线程支持

众所周知，Java直到JDK1.3.x不支持任何方法用于处理网络连接除了一个线程处理一个客户端。Volanomark是一个好的小型性能测试，测量在不同数量的并发连接上每秒消息的吞吐量。2003年5月，在自不同供应商的JDK1.3实现实际能够处理1w个并发连接--尽管有明显的性能退化。
*** 注解：1:1线程与M:N线程对比

当实现一个线程库时有一个选择：你既可以将所有线程支持放入内核（它称为1:1线程模型），或者你可以将它移到用户空间（这称为M:N线程模型）。有一点，M:N虽然性能更高，但它非常复杂以致于很难正确使用它，许多人都正在远离它。
- [[http://marc.theaimsgroup.com/?l=linux-kernel&m=103284879216107&w=2][为什么Ingo Molnar喜欢1:1超过M:N]]
- [[http://java.sun.com/docs/hotspot/threads/threads.html][Sun正转移到1:1线程]]
- [[http://www-124.ibm.com/pthreads/][NGPT]] 是一个Linux M:N线程库
- 虽然Ulrich Drepper计划在新glibc线程库中使用M:N线程，但后来他切换到了1:1线程模型
- MacOSX 似乎使用1:1模型
- [[http://people.freebsd.org/~julian/][FreeBSD]] 和[[http://web.mit.edu/nathanw/www/usenix/freenix-sa/][NetBSD]] 似乎仍然相信M:N线程...
** 在内核中构建服务器代码
Novell和Microsoft都说过在某些时间做过这个。至少一个NFS实现做过这个，[[http://www.fenrus.demon.nl/][khttpd]] 为Linux和静态网页做过这个，并且[[http://slashdot.org/comments.pl?sid=00/07/05/0211257&cid=218]["TUX"(Threaded linUX webserver)]]是一个由Ingo Molnar为Linux编写的非常快速和灵活kernel-space的HTTP服务器。Ingo的2000年9月1日公告说一个alpha版本的TUX可以从ftp://ftp.redhat.com/pub/redhat/tux 下载，并且解释了如何加入邮件列表获取更多信息。

linux-kernel列表已经讨论了这种方法的利弊，并一致认为不应该将web servers移入内核，而是内核应该添加最小合理的hooks提升web sersver的性能。这样，其它类型的serves可以受益。
* 将TCP栈带入用户空间
查看实例，[[http://info.iet.unipi.it/~luigi/netmap/][netmap]] 包I/O框架，和[[http://conferences.sigcomm.org/hotnets/2013/papers/hotnets-final43.pdf][Sandstorm]] 基于它的概念验证web server。
