article/C10K.html

<div id="outline-container-4-4-3" class="outline-4">
<h4 id="sec-4-4-3"><span class="section-number-4">4.4.3</span> NPTL：Native Posix Thread Library for Linux</h4>
<div class="outline-text-4" id="text-4-4-3">


<p><br/>
<a href="http://people.redhat.com/drepper/nptl/">NPTL</a> 是由<a href="http://people.redhat.com/drepper/">Ulrich Drepper</a>和<a href="http://people.redhat.com/mingo/">Ingo Molnar</a>发起的项目，带来世界级的Posix Linux线程支持。<br/>
</p>
<p><br/>
2003年十月5日，NPTL作为一个附加目录合并进glibc cvs树中，所以几乎肯定它将会随着glibc下一版本一起发布。<br/>
</p>
<p><br/>
NPTL链接：<br/>
</p><ul>
<li><a href="http://https//listman.redhat.com/mailman/listinfo/phil-list">讨论NPTL的邮件列表</a><br/>
</li>
<li><a href="http://people.redhat.com/drepper/nptl/">NPTL源代码</a><br/>
</li>
<li><a href="http://lwn.net/Articles/10465/">NPTL初始声明</a><br/>
</li>
<li><a href="http://people.redhat.com/drepper/glibcthreads.html">描述NPTL目标的原始白皮书</a><br/>
</li>
<li><a href="http://people.redhat.com/drepper/nptl-design.pdf">描述NPTL最终设计的修订白皮书</a><br/>
</li>
<li><a href="http://marc.theaimsgroup.com/?l=linux-kernel&amp;m=103230439008204&amp;w=2">Ingo Molnar</a>的第一个性能测试显示它能够处理10^6个线程<br/>
</li>
<li><a href="http://marc.theaimsgroup.com/?l=linux-kernel&amp;m=103269598000900&amp;w=2">Ulrich的性能测试</a> 比较Linux线程,NPTL,IBM的NGPT的性能。它似乎显示了NPTL比NGPT快的多。<br/>
</li>
</ul>

<p>这是我尝试描述NPTL的历史（参考<a href="http://www.onlamp.com/pub/a/onlamp/2002/11/07/linux_threads.html">Jerry Cooperstein的文章</a>）：<br/>
</p>
<p><br/>
2002年3月，NGPT团队的Bill Abt，glibc维护人Ulrich Drepper，和其它人开会找出如何处理Linux线程。其中从会议提出的一个想法是改进互斥性能；Rusty Russell等人随后实现了<a href="http://marc.theaimsgroup.com/?l=linux-kernel&amp;m=102196625921110&amp;w=2">快速用户空间互斥</a>(futexes)，它现在被NGPT和NPTL使用。大部分与会员指出NGPT应该合并到glibc中。<br/>
</p>
<p><br/>
Ulrich Drepper虽然不喜欢NGPT，并且指出他可以做的更好。几个月之后，Ulrich Drepper，Ingo Molnar，和其他贡献glibc和内核的人一起编写名为Native Posix Threads Library(NPTL)的线程库。NPTL使用所有为NGPT内核增强设计，使用了少部分新设计。Ingo Molnar描述内核增强如下：<br/>
当NPTL使用三个由NGPT引进的内核功能：getpid()返回PID，CLONE_THREAD和futexes；NPTL也使用了（依赖）许多新内核功能。<br/>
</p>
<p><br/>
NGPT一部功能引入内核2.5.8左右时被修改，清理和扩展，例如线程组处理(CLONE_THREAD)。<br/>
</p>
<p><br/>
NPTL开发和使用的内核功能在<a href="http:// http//people.redhat.com/drepper/nptl-design.pdf">设计白皮书</a> 被描述。<br/>
</p>
<p><br/>
<i>简短列表：TLS支持，各种clone扩展(CLONE_SETTLS,CLONE_SETTID,CLONE_CLEARTID)，POSIX线程信号处理，sys_exit()扩展，sys_exit_group()系统调用，sys_execve()增强，支持独立线程</i><br/>
</p>
<p><br/>
<i>在扩展PID空间也做了很多工作--例如，procfs因为假设64K PID而崩溃，max_pid和pid分配可伸缩性工作。同时一些性能优化也做得很好</i><br/>
</p>
<p><br/>
<i>本质上新功能并非是为了1:1线程的妥协议方法--内核现在尽可能改善线程，同进我们精确地最小层度上为每个基本线程原语做一些上下文切换和系统调用。</i><br/>
</p>
<p><br/>
<i>两者最大的一个不同点是NPTL是一个1:1线程模型，而NGPT是一个M:N线程模型。尽管如此，Ulrich的初始性能测试几乎显示出NPTL确实与NGPT快得多。</i><br/>
</p>
<p><br/>
</p></div>

</div>

<div id="outline-container-4-4-4" class="outline-4">
<h4 id="sec-4-4-4"><span class="section-number-4">4.4.4</span> FreeBSD线程支持</h4>
<div class="outline-text-4" id="text-4-4-4">


<p><br/>
FreeBSD同时支持Linux线程和一个用户空间线程库。并且，一个称为KSE的M:N实现在FreeBSD5.0中被引入。参考www.unobvious.com/bsd/freebsd-threads.html.<br/>
</p>
<p> <br/>
2003年3月25日,Jeff Roberson在freebsd-arch发布:<br/>
...感谢由Julian, David Xu, Mini, Da Eischen,提供的基金会和每一位曾经参考KSE和libpthread开发的人。Mini和我已经开发了一个1:1线程实现。这个代码能够和KSE并行，而且不会以任何方式破坏它。<br/>
</p>
<p><br/>
2006年7月，Robert Watson提议1:1线程实现成为FreeBSD7.x的默认形式：<br/>
...<br/>
</p></div>

</div>

<div id="outline-container-4-4-5" class="outline-4">
<h4 id="sec-4-4-5"><span class="section-number-4">4.4.5</span> NetBSD线程支持</h4>
<div class="outline-text-4" id="text-4-4-5">


<p><br/>
根据从自Noriyuki Soda的一篇日志：<br/>
<i>内核支持基于Scheduler Activations模型的M:N线程库在2003-1-18合并到NetBSD-current中。</i><br/>
</p>
<p><br/>
更多详情，参考由Nathan J. Williams,Wasabi System编写的<a href="http://web.mit.edu/nathanw/www/usenix/freenix-sa/">An Implementation of Scheduler Activations on the NetBSD Operating System</a>。<br/>
</p></div>

</div>

<div id="outline-container-4-4-6" class="outline-4">
<h4 id="sec-4-4-6"><span class="section-number-4">4.4.6</span> Solaris线程支持</h4>
<div class="outline-text-4" id="text-4-4-6">


<p><br/>
Solaris对线程的支持从Solaris2到Solaris8在不断地发展，默认线程库使用了一个M:N模型，但是Solaris9默认是1:1模型线程支持。查看<a href="http://docs.sun.com/db/doc/805-5080">Sun's multithreaded programming guide</a> 和<a href="http://java.sun.com/docs/hotspot/threads/threads.html">Sun's note about Java and Solaris threading</a>.<br/>
</p></div>

</div>

<div id="outline-container-4-4-7" class="outline-4">
<h4 id="sec-4-4-7"><span class="section-number-4">4.4.7</span> JDK1.3.x和更早Java线程支持</h4>
<div class="outline-text-4" id="text-4-4-7">


<p><br/>
众所周知，Java直到JDK1.3.x不支持任何方法用于处理网络连接除了一个线程处理一个客户端。Volanomark是一个好的小型性能测试，测量在不同数量的并发连接上每秒消息的吞吐量。2003年5月，在自不同供应商的JDK1.3实现实际能够处理1w个并发连接--尽管有明显的性能退化。<br/>
</p></div>

</div>

<div id="outline-container-4-4-8" class="outline-4">
<h4 id="sec-4-4-8"><span class="section-number-4">4.4.8</span> 注解：1:1线程与M:N线程对比</h4>
<div class="outline-text-4" id="text-4-4-8">


<p><br/>
当实现一个线程库时有一个选择：你既可以将所有线程支持放入内核（它称为1:1线程模型），或者你可以将它移到用户空间（这称为M:N线程模型）。有一点，M:N虽然性能更高，但它非常复杂以致于很难正确使用它，许多人都正在远离它。<br/>
</p><ul>
<li><a href="http://marc.theaimsgroup.com/?l=linux-kernel&amp;m=103284879216107&amp;w=2">为什么Ingo Molnar喜欢1:1超过M:N</a><br/>
</li>
<li><a href="http://java.sun.com/docs/hotspot/threads/threads.html">Sun正转移到1:1线程</a><br/>
</li>
<li><a href="http://www-124.ibm.com/pthreads/">NGPT</a> 是一个Linux M:N线程库<br/>
</li>
<li>虽然Ulrich Drepper计划在新glibc线程库中使用M:N线程，但后来他切换到了1:1线程模型<br/>
</li>
<li>MacOSX 似乎使用1:1模型<br/>
</li>
<li><a href="http://people.freebsd.org/~julian/">FreeBSD</a> 和<a href="http://web.mit.edu/nathanw/www/usenix/freenix-sa/">NetBSD</a> 似乎仍然相信M:N线程...<br/>
</li>
</ul>

</div>
</div>

</div>

<div id="outline-container-4-5" class="outline-3">
<h3 id="sec-4-5"><span class="section-number-3">4.5</span> 在内核中构建服务器代码</h3>
<div class="outline-text-3" id="text-4-5">

<p>Novell和Microsoft都说过在某些时间做过这个。至少一个NFS实现做过这个，<a href="http://www.fenrus.demon.nl/">khttpd</a> 为Linux和静态网页做过这个，并且<a href="http://slashdot.org/comments.pl?sid=00/07/05/0211257&amp;cid=218">"TUX"(Threaded linUX webserver)</a>是一个由Ingo Molnar为Linux编写的非常快速和灵活kernel-space的HTTP服务器。Ingo的2000年9月1日公告说一个alpha版本的TUX可以从<a href="ftp://ftp.redhat.com/pub/redhat/tux">ftp://ftp.redhat.com/pub/redhat/tux</a> 下载，并且解释了如何加入邮件列表获取更多信息。<br/>
</p>
<p><br/>
linux-kernel列表已经讨论了这种方法的利弊，并一致认为不应该将web servers移入内核，而是内核应该添加最小合理的hooks提升web sersver的性能。这样，其它类型的serves可以受益。<br/>
</p></div>
</div>

</div>

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> 将TCP栈带入用户空间</h2>
<div class="outline-text-2" id="text-5">

<p>查看实例，<a href="http://info.iet.unipi.it/~luigi/netmap/">netmap</a> 包I/O框架，和<a href="http://conferences.sigcomm.org/hotnets/2013/papers/hotnets-final43.pdf">Sandstorm</a> 基于它的概念验证web server。<br/>
</p></div>

</div>
