article/C10K.html

<div id="outline-container-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> 评论</h2>
<div class="outline-text-2" id="text-6">

<p>Richard Gooch编写了<a href="http://www.atnf.csiro.au/~rgooch/linux/docs/io-events.html">讨论I/O选项的文章</a>。<br/>
</p>
<p><br/>
2001年，Tim Brecht和MMichal Ostrowski为简单的select-based服务器<a href="http://www.hpl.hp.com/techreports/2001/HPL-2001-314.html">测量各种策略</a>。<br/>
</p>
<p><br/>
2003年，Tim Brecht提交了<a href="http://www.hpl.hp.com/research/linux/userver/">userver的源代码</a> ，一个小型web server，将Abhishek Chandra,David Mosberger,David Pariag,和Michal Ostrowski编写的几种servers放在一起。它能够使用select()，poll()，epoll()或sigio。<br/>
</p>
<p><br/>
回到1999年3月，Dean Gaudet 提出：<br/>
  <i>我一直在问：“你们为什么不像Zeus一样使用基于select/event的模型？它显示是最快的”...</i><br/>
他把原因归结为"它太难使用了，并且好处不太明显"。几个月后，好处变得明显，人们开始愿意使用它。<br/>
</p>
<p><br/>
Mark Russinovich编写<a href="http://linuxtoday.com/stories/5499.html">一个期刊</a> 和 <a href="http://www.winntmag.com/Articles/Index.cfm?ArticleID=5048">一篇文章</a> 讨论了在2.2Linux内核中I/O策略争论。即使在一些问题上他似乎有错误，但也值得一读。特别是，他似乎认为Linux2.2的异步I/O（查看上面的F_SETSIG）在当数据就绪时不会通知用户进程，只在当新连接到达时才通知。这似乎是一个奇怪的误区。也可以看看关于早期草案的评论，1999年4月30号Ingo Molnar的反驳，1999年5月2日Russinovich的评论，Alan Cox的反驳，各种linux-kernel邮件。我猜想他试图说Linux不支持异步磁盘I/O，这曾经是真实的，但现在SGI已经实现了KAIO，它不再那么真实了。<br/>
</p>
<p><br/>
看看<a href="http://www.sysinternals.com/ntw2k/info/comport.shtml">sysinternals.com</a> 和<a href="http://msdn.microsoft.com/library/techart/msdn_scalabil.htm">MSDN</a> 上关于"completion ports"信息的论文， 据说这是NT独一无二的。简而言之，win32的"重叠I/O"是因为太低级而不方便使用，"completion ports"是一个封装，提供了一个完成事件的队列，加上魔法般的调度，试图通过如果其它线程在获取完全事件的端口上睡眠（也许在做阻塞I/O），允许更多线程获取完成事件来保持运行线程的数目恒定。<br/>
</p>
<p><br/>
查看<a href="http://www.as400.ibm.com/developer/v4r5/api.html">OS/400对I/O completion ports的支持</a>。<br/>
</p>
<p><br/>
1999年9月在linux-kernel上有一个有趣的讨论，标题为"&gt;15000并发连接"。突出亮点：<br/>
</p><ul>
<li>Ed Hall<a href="http://www.linuxhq.com/lnxlists/linux-kernel/lk_9909_01/msg00807.html">提交 </a>了一些关于他经验的日记；他在一个运行Solaris的UP P2/333上实现了&gt;1000连接/秒。它的代码使用了一个小型的连接池(每个CPU1或2)，每个线程通过使用"一个基于事件模型"管理大量的客户端。<br/>
</li>
<li>Mike Jagdis提交了<a href="http://www.linuxhq.com/lnxlists/linux-kernel/lk_9909_01/msg00831.html">一个关于poll/select开销分析</a> ，他说"当前select/poll的实现可以大大地改进，尤其在阻塞方面，但开销仍然会随着描述符的数量增长而增长，因为select/poll不能记住哪些描述符是被关注的。这将容易使用新API来修复它..."<br/>
</li>
<li>Mike提交了关于他在改进select()和poll()上的工作。<br/>
</li>
<li>Mike提交了一点关于一个可能代替poll()/select()的API<br/>
</li>
<li>Rogier Wolff suggested using "the API that the digital guys suggested", <a href="http://www.cs.rice.edu/~gaurav/papers/usenix99.ps">http://www.cs.rice.edu/~gaurav/papers/usenix99.ps</a><br/>
</li>
<li>Joerg Pommnitz指出沿着这个方向的新API应该能不仅可以等待文件描述符事件，也可以等待信号和SYSV-IPC.我们同步原语当然应该至少能完成Win32的WaitForMultipleObjects所做的事.<br/>
</li>
<li>Stephen Tweedie asserted that the combination of F_SETSIG, queued realtime signals, and sigwaitinfo() was a superset of the API proposed in <a href="http://www.cs.rice.edu/~gaurav/papers/usenix99.ps">http://www.cs.rice.edu/~gaurav/papers/usenix99.ps</a>. He also mentions that you keep the signal blocked at all times if you're interested in performance; instead of the signal being delivered asynchronously, the process grabs the next one from the queue with sigwaitinfo().<br/>
</li>
<li>Jayson Nordwick比较了completion ports与F_SETSIG异步事件模型,得出结论是它们非常相似.<br/>
</li>
<li>Alan Cox noted that an older rev of SCT's SIGIO patch is included in 2.3.18ac.<br/>
</li>
<li>Jordan Mendelson提交了一些示例代码展示如何使用F_SETSIG。<br/>
</li>
<li>Stephen C. Tweedie continued the comparison of completion ports and F_SETSIG, and noted: "With a signal dequeuing mechanism, your application is going to get signals destined for various library components if libraries are using the same mechanism," but the library can set up its own signal handler, so this shouldn't affect the program (much).<br/>
</li>
<li>Doug Royer noted that he'd gotten 100,000 connections on Solaris 2.6 while he was working on the Sun calendar server. Others chimed in with estimates of how much RAM that would require on Linux, and what bottlenecks would be hit. <br/>
</li>
</ul>


<p><br/>
</p></div>

</div>

<div id="outline-container-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> 打开文件句柄上的限制</h2>
<div class="outline-text-2" id="text-7">

<ul>
<li>任何Unix:通过ulimit或setrlimit设置限制<br/>
</li>
<li>Solaris:查看Solaris的FAQ，问题3.46<br/>
</li>
<li>FreeBSD:<br/>
  编辑/boot/loader.conf，添加行：<br/>
  set kern.maxfiles=xxxx<br/>
  xxxx是关于文件描述符的系统限制，然后重启。<br/>
</li>
<li>OpenBSD:一个读者说：<br/>
  "在OpenBSD中，为了增加每个进程打开文件句柄的数量，需要额外的调整：需要增加/etc/login.conf中openfiles-cur参数的值。你可以使用sysctl-w或在sysctl.conf改变kern.maxfiles，但没有作用。"<br/>
</li>
<li>Linux:查看Bodo Bauer的/proc文档，在2.4内核上：<br/>

<p><br/>
  echo 32768 &gt; /proc/sys/fs/file-max<br/>
</p>
<p>  <br/>
  增加打开文件的系统限制<br/>
</p>
<p>  <br/>
  ulimit -n 32768<br/>
</p>
<p>  <br/>
  添加当前进程的限制<br/>
</p>
<p>  <br/>
  在2.2.x内核上：<br/>
</p>
<p>  <br/>
  echo 32768 &gt; /proc/sys/fs/file-max<br/>
  echo 65536 &gt; /proc/sys/fs/inode-max<br/>
</p>
<p>  <br/>
  添加打开文件的系统限制<br/>
</p>
<p>  <br/>
  ulimia -n 32768<br/>
</p>
<p>  <br/>
  增加当前进程限制<br/>
</p>
<p>  <br/>
  我证实在Red Hat6.0上使用这个方式一个进程可以打开至少31000文件描述符。其他同事也证实在2.2.12上用这个方式可以打开至少90000文件描述。上界似乎是可用内存。<br/>
</p>
<p>  <br/>
  Stephen C. Tweedie提交了关于如何设置全局ulimit限制或每个用户在启动时使用initscript和pam_limit。<br/>
</p>
<p>  <br/>
  在2.2内核以前，即使使用上面的方法，每个进程打开文件的数量仍然限制为1024。<br/>
</p>
<p>  <br/>
  查看Oskar的1998年邮件，谈论了在2.0.36内核中每个进程和系统范围的关于文件描述符限制。<br/>
</p></li>
</ul>

</div>

</div>

<div id="outline-container-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> 线程上的限制</h2>
<div class="outline-text-2" id="text-8">

<p>  在任何体系架构上，为了避免虚拟内存耗尽你可能需要减少每个线程的栈空间分配大小。如果你使用线程，你可以在运行时使用pthread_att_init()设置它。<br/>
</p><ul>
<li>Solaris: 它支持尽可能多地将线程装入内存，我听说。<br/>
</li>
<li>使用NPTL的Linux2.6内核：/proc/sys/vm/max_map_count可以需要增加到32000以上个线程<br/>
</li>
<li>Linux2.4：/proc/sys/kernel/threads-max是线程的最大数量；在我的Red Hat 8系统上它默认是2047。你可以通过将一个新值写入那个文件来增加最大数量，如"echo 4000 &gt; /proc/sys/kernel/threads-max"<br/>
</li>
<li>Linux2.2：<br/>
</li>
<li>Java:<br/>
</li>
</ul>

</div>

</div>

<div id="outline-container-9" class="outline-2">
<h2 id="sec-9"><span class="section-number-2">9</span> Java争论</h2>
<div class="outline-text-2" id="text-9">

</div>

</div>

<div id="outline-container-10" class="outline-2">
<h2 id="sec-10"><span class="section-number-2">10</span> 其他技巧</h2>
<div class="outline-text-2" id="text-10">

<ul>
<li>Zero-Copy : <br/>
  通常，数据从这里到那里需要复制多次。任何消除这些复制使之减少到最小物理限度的方法称为"zero-copy"。<br/>
<ul>
<li>在Linux2.4.17-2.4.20上Thomas Ogrisegg的映射文件zero-copy发送补丁，声称它比sendfile()更快。<br/>
</li>
<li>IO-Lite是一个关于I/O原语提议，它可以消除多个复本。<br/>
</li>
<li>1999年Alan Cox注释zero-copy有时候不值得去做。<br/>
</li>
<li>Ingo在2000年7月在2.4内核为TUX1.0实现了一种zero-copy TCP的形式，并说将很快用让它作用于户空间。<br/>
</li>
<li>Drew Gallatin和Robert Picco已经将一些zero-copy功能添加到FreeBSD中；<br/>
</li>
<li>sendfile()系统调用能够实现zero-copy网络<br/>
    在Linux和FreeBSD上，sendfile()函数让你告诉内核发送一个文件或部分。让OS尽可能高效的去完成这件事。<br/>
</li>
</ul>

</li>
<li>使用writev(或TCP_CORK)避免小帧<br/>
  在Linux下有一个新的socket选项，TCP_CORK，告诉内核避免发送部分帧，这有一点帮助。比如当存在大量write()调用时，因为某些原因你不能将它们捆绑在一起。不设置选项，刷新缓冲区。使用writev()更好。<br/>
</li>
<li>在超负荷状态下智能感知<br/>
</li>
<li>一些程序能够得利于使用non-Posix线程<br/>
</li>
<li>缓存你自己数据有时会有好处<br/>
</li>
</ul>

</div>

</div>

<div id="outline-container-11" class="outline-2">
<h2 id="sec-11"><span class="section-number-2">11</span> 其它限制</h2>
<div class="outline-text-2" id="text-11">

<p>  旧系统库可能使用16位变量保存文件句柄，32767个以上句柄会引起麻烦。glibc2.1应该没问题。<br/>
  许多系统使用16位变量保存进程或线程的ID。将Volano扩展基准测试移植到C将是有趣的，看看各种操作系统上线程的上限是多少。<br/>
  有一些操作系统给线程局部内存分配过多；如果每个线程分配1MB，总VM空间是2GB，那样可以创建一个2000线程的上限。<br/>
  看看<a href="http://www.acme.com/software/thttpd/benchmarks.html">http://www.acme.com/software/thttpd/benchmarks.html</a> 底部性能比较图。<br/>
</p></div>

</div>

<div id="outline-container-12" class="outline-2">
<h2 id="sec-12"><span class="section-number-2">12</span> 内核争论</h2>
<div class="outline-text-2" id="text-12">

</div>

</div>

<div id="outline-container-13" class="outline-2">
<h2 id="sec-13"><span class="section-number-2">13</span> 测量服务器性能</h2>
<div class="outline-text-2" id="text-13">

</div>

</div>

<div id="outline-container-14" class="outline-2">
<h2 id="sec-14"><span class="section-number-2">14</span> 示例</h2>
<div class="outline-text-2" id="text-14">

<p>  Nginx是一个web服务器，它在目标OS上使用任何可用的高效网络事件机制。它越来越受欢迎。<br/>
</p>
</div>
