article/C10K.org
** 基于select()的servers
- [[http://www.acme.com/software/thttpd/][thttpd]] 非常简单。使用单进程。它拥有好的性能，但不能随着CPU的数量自动扩展。也能够使用kqueue。
- [[http://mathop.diva.nl/][mathopd]] 与thttpd 类似
- [[http://www.fhttpd.org/][fhttpd]]
- [[http://www.boa.org/][boa]]
- [[http://www.roxen.com/][Roxen]]
- [[http://www.zeustech.net/][Zeus]] 一个商业版server，试图成为绝对的最快server。
- [[http://ca.us.mirrors.freshmeat.net/appindex/1999/02/17/919251275.html][BetaFTPd]]
- [[http://www.cs.rice.edu/~vivek/iol98/][Flash-Lite]] 使用IO-Lite的web server
- [[http://www.cs.rice.edu/~vivek/flash99/][Flash]]:一个高效可移植的web server--使用select(),mmap(),mincore()
- [[http://www.cs.princeton.edu/~yruan/debox/][2003年的Flash web server]] --使用select(),修订的sendfile(),异步open()
- [[http://www.imatix.com/html/xitami/][xitami]]
- [[http://www.nightmare.com/medusa/medusa.html][Medusa]]
- [[http://www.hpl.hp.com/research/linux/userver/][userver]] - 一个小型http server，能够使用select,poll,epoll或sigio
** 基于/dev/poll的servers
N. Provos, C. Lever,"[[http://www.citi.umich.edu/techreports/reports/citi-tr-00-4.pdf][Scalable Network I/O in Linux]],"描述了一个thttpd修改版本，支持/dev/poll。性能与phhttpd与相比。
** 基于epoll的servers
- [[https://github.com/Adaptv/ribs2][ribs2]]
- [[http://bogomips.org/cmogstored/README][cmogstored]] -为大部分网络使用epoll/kqueue，为磁盘和accept4使用线程.
** 基于kqueue的servers
- [[http://www.acme.com/software/thttpd/][thttpd]]
** 基于实时信号的servers
- Chromium的X15
- Zach Brown的[[Chromium][phhttpd]]
** 基于线程的servers
- [[http://www.zabbo.net/hftpd/][Hoser FTPD]]
- Peter Eriksson的[[http://ca.us.mirrors.freshmeat.net/appindex/1999/02/06/918317238.html][phttpd]]和
- [[http://ca.us.mirrors.freshmeat.net/appindex/1999/02/06/918313631.html][pftpd]]
- 基于Java servers在http://www.acme.com/software/thttpd/benchmarks.html 被列出
- Sun的[[http://jserv.javasoft.com/][Java Web Server]](被报道处理500并发客户端)
** 在内核中的servers
- [[http://www.fenrus.demon.nl/][khttpd]]
- [[http://slashdot.org/comments.pl?sid=00/07/05/0211257&cid=218]["TUX" (Threaded linUX webserver)]]
* 其它有趣的链接
- [[http://pl.atyp.us/content/tech/servers.html][Jeff Darcy's notes on high-performance server design]]
- [[http://www2.linuxjournal.com/lj-issues/issue91/4752.html][Ericsson's ARIES project]] -- benchmark results for Apache 1 vs. Apache 2 vs. Tomcat on 1 to 12 processors
- [[http://nakula.rvs.uni-bielefeld.de/made/artikel/Web-Bench/web-bench.html][Prof. Peter Ladkin's Web Server Performance]] page.
- [[http://www.novell.com/bordermanager/ispcon4.html][Novell's FastCache]] -- claims 10000 hits per second. Quite the pretty performance graph.
- Rik van Rielr的[[http://linuxperf.nl.linux.org/][Linux Performance Tuning site]]

