article/C10K.html

<div id="outline-container-14-1" class="outline-3">
<h3 id="sec-14-1"><span class="section-number-3">14.1</span> 基于select()的servers</h3>
<div class="outline-text-3" id="text-14-1">

<ul>
<li><a href="http://www.acme.com/software/thttpd/">thttpd</a> 非常简单。使用单进程。它拥有好的性能，但不能随着CPU的数量自动扩展。也能够使用kqueue。<br/>
</li>
<li><a href="http://mathop.diva.nl/">mathopd</a> 与thttpd 类似<br/>
</li>
<li><a href="http://www.fhttpd.org/">fhttpd</a><br/>
</li>
<li><a href="http://www.boa.org/">boa</a><br/>
</li>
<li><a href="http://www.roxen.com/">Roxen</a><br/>
</li>
<li><a href="http://www.zeustech.net/">Zeus</a> 一个商业版server，试图成为绝对的最快server。<br/>
</li>
<li><a href="http://ca.us.mirrors.freshmeat.net/appindex/1999/02/17/919251275.html">BetaFTPd</a><br/>
</li>
<li><a href="http://www.cs.rice.edu/~vivek/iol98/">Flash-Lite</a> 使用IO-Lite的web server<br/>
</li>
<li><a href="http://www.cs.rice.edu/~vivek/flash99/">Flash</a>:一个高效可移植的web server--使用select(),mmap(),mincore()<br/>
</li>
<li><a href="http://www.cs.princeton.edu/~yruan/debox/">2003年的Flash web server</a> --使用select(),修订的sendfile(),异步open()<br/>
</li>
<li><a href="http://www.imatix.com/html/xitami/">xitami</a><br/>
</li>
<li><a href="http://www.nightmare.com/medusa/medusa.html">Medusa</a><br/>
</li>
<li><a href="http://www.hpl.hp.com/research/linux/userver/">userver</a> - 一个小型http server，能够使用select,poll,epoll或sigio<br/>
</li>
</ul>

</div>

</div>

<div id="outline-container-14-2" class="outline-3">
<h3 id="sec-14-2"><span class="section-number-3">14.2</span> 基于/dev/poll的servers</h3>
<div class="outline-text-3" id="text-14-2">

<p>N. Provos, C. Lever,"<a href="http://www.citi.umich.edu/techreports/reports/citi-tr-00-4.pdf">Scalable Network I/O in Linux</a>,"描述了一个thttpd修改版本，支持/dev/poll。性能与phhttpd与相比。<br/>
</p></div>

</div>

<div id="outline-container-14-3" class="outline-3">
<h3 id="sec-14-3"><span class="section-number-3">14.3</span> 基于epoll的servers</h3>
<div class="outline-text-3" id="text-14-3">

<ul>
<li><a href="https://github.com/Adaptv/ribs2">ribs2</a><br/>
</li>
<li><a href="http://bogomips.org/cmogstored/README">cmogstored</a> -为大部分网络使用epoll/kqueue，为磁盘和accept4使用线程.<br/>
</li>
</ul>

</div>

</div>

<div id="outline-container-14-4" class="outline-3">
<h3 id="sec-14-4"><span class="section-number-3">14.4</span> 基于kqueue的servers</h3>
<div class="outline-text-3" id="text-14-4">

<ul>
<li><a href="http://www.acme.com/software/thttpd/">thttpd</a><br/>
</li>
</ul>

</div>

</div>

<div id="outline-container-14-5" class="outline-3">
<h3 id="sec-14-5"><span class="section-number-3">14.5</span> 基于实时信号的servers</h3>
<div class="outline-text-3" id="text-14-5">

<ul>
<li>Chromium的X15<br/>
</li>
<li>Zach Brown的<a href="#Chromium">phhttpd</a><br/>
</li>
</ul>

</div>

</div>

<div id="outline-container-14-6" class="outline-3">
<h3 id="sec-14-6"><span class="section-number-3">14.6</span> 基于线程的servers</h3>
<div class="outline-text-3" id="text-14-6">

<ul>
<li><a href="http://www.zabbo.net/hftpd/">Hoser FTPD</a><br/>
</li>
<li>Peter Eriksson的<a href="http://ca.us.mirrors.freshmeat.net/appindex/1999/02/06/918317238.html">phttpd</a>和<br/>
</li>
<li><a href="http://ca.us.mirrors.freshmeat.net/appindex/1999/02/06/918313631.html">pftpd</a><br/>
</li>
<li>基于Java servers在<a href="http://www.acme.com/software/thttpd/benchmarks.html">http://www.acme.com/software/thttpd/benchmarks.html</a> 被列出<br/>
</li>
<li>Sun的<a href="http://jserv.javasoft.com/">Java Web Server</a>(被报道处理500并发客户端)<br/>
</li>
</ul>

</div>

</div>

<div id="outline-container-14-7" class="outline-3">
<h3 id="sec-14-7"><span class="section-number-3">14.7</span> 在内核中的servers</h3>
<div class="outline-text-3" id="text-14-7">

<ul>
<li><a href="http://www.fenrus.demon.nl/">khttpd</a><br/>
</li>
<li><a href="http://slashdot.org/comments.pl?sid=00/07/05/0211257&amp;cid=218">"TUX" (Threaded linUX webserver)</a><br/>
</li>
</ul>

</div>
</div>

</div>

<div id="outline-container-15" class="outline-2">
<h2 id="sec-15"><span class="section-number-2">15</span> 其它有趣的链接</h2>
<div class="outline-text-2" id="text-15">

<ul>
<li><a href="http://pl.atyp.us/content/tech/servers.html">Jeff Darcy's notes on high-performance server design</a><br/>
</li>
<li><a href="http://www2.linuxjournal.com/lj-issues/issue91/4752.html">Ericsson's ARIES project</a> -- benchmark results for Apache 1 vs. Apache 2 vs. Tomcat on 1 to 12 processors<br/>
</li>
<li><a href="http://nakula.rvs.uni-bielefeld.de/made/artikel/Web-Bench/web-bench.html">Prof. Peter Ladkin's Web Server Performance</a> page.<br/>
</li>
<li><a href="http://www.novell.com/bordermanager/ispcon4.html">Novell's FastCache</a> -- claims 10000 hits per second. Quite the pretty performance graph.<br/>
</li>
<li>Rik van Rielr的<a href="http://linuxperf.nl.linux.org/">Linux Performance Tuning site</a><br/>
</li>
</ul>


<p><br/>
</p></div>
</div>
</div>

<div id="postamble">
<p class="creator"><a href="http://orgmode.org">Org</a> version 7.9.3f with <a href="http://www.gnu.org/software/emacs/">Emacs</a> version 24</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
